<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"6810a739ed403bccfcf9fca285433a1026fc903f282163cc93b15ff05672d202","plan_job_ref":"Job Terraform checks on pull request #40 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13423065788","plan_out_hash":"9d73ea58cc4d45f184ab390b4d0e1eaba22b27fa525c625197297fef935fcf56","plan_hash":"2fb39aab2ef08d178c1ecccecbca4927a532419e2203226e42ce6fc4e35005c3","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __./__
<details>
<summary>Plan: 1 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories["sudoblark.azure-devops.library"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.azure-devops.library"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.azure-devops.library"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.azure-devops.library"
        name                        = "sudoblark.azure-devops.library"
!~      visibility                  = "public" -> "private"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.azure-devops.workflows"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.azure-devops.workflows"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.azure-devops.workflows"
        name                        = "sudoblark.azure-devops.workflows"
!~      visibility                  = "public" -> "private"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.github-actions.workflows"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.github-actions.workflows"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.github-actions.workflows"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.github-actions.workflows"
        name                        = "sudoblark.github-actions.workflows"
!~      visibility                  = "public" -> "private"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.monsternames.api"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.monsternames.api"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.monsternames.api"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
!~      description                 = "Lambda container for the monsternames-api RESTAPI backend. - repo managed by sudoblark.terraform.github" -> "Open-source RESTAPI realised via data-structure and algorithm driven Terraform principles. - repo managed by sudoblark.terraform.github"
        id                          = "sudoblark.monsternames.api"
        name                        = "sudoblark.monsternames.api"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.monsternames.open-api"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.monsternames.open-api"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.monsternames.open-api"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.monsternames.open-api"
        name                        = "sudoblark.monsternames.open-api"
!~      visibility                  = "public" -> "private"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.ci-cd-observability-monitoring"].github_branch_protection.main will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = "************"
+       require_conversation_resolution = true
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           required_approving_review_count = 1
        }

+       required_status_checks {
+           strict = true
        }
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #40](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13423065788)